/*****************************************************************************
* Создайте программу, которая фильтрует список строк и возвращает список, 
* содержащий только имя вашего друга.
* Если в имени ровно 4 буквы, вы можете быть уверены, что это ваш друг!
* Пример: Ввод = ["Ryan", "Kieran", "Jason", "Yous"], Вывод = ["Ryan", "Yous"]
* друг ["Ryan", "Kieran", "Mark"] `Должен быть" ["Ryan", "Mark"]
* Примечание: сохраняйте первоначальный порядок имен в выходных данных.
******************************************************************************/

const listName = ["Ryan", "Kieran", "Jason", "Yous"];

function friend(friends) {
    const bestFriends = [];
    friends.forEach(item => {
        if (item.length == 4) {
            bestFriends.push(item);
        }
    });
    return bestFriends;
}

console.log(friend(listName));