def main():
    array = filling_array()
    average = round(arithmetic_mean(array), 3)
    max = maximum_minimum(array, "max")
    min = maximum_minimum(array, "min")
    remains = sum_of_remainder_of_division(array)
    print(average, max, min, remains)


def filling_array():
    """ 
        Принимает от пользователя по одному числу и складывает в массив,
        пока не встретим знак #, который не включается в массив, ввод
        чисел прерывается
    """

    array = [7, 59, 79, 56, 51, 29, 98, 32, 16, 72, 92, 77, 65, 66, 98, 14, 43, 16, 7, 59, 21, 83, 3, 50, 27, 12, 89, 78, 74, 76, 23, 25, 99, 100, 54, 96, 96, 98, 52, 47, 44, 7, 44, 30, 48, 21, 43, 12, 69, 21, 88, 22, 52, 11, 70, 73, 70, 49, 72, 2, 48, 85, 96, 2, 101, 87, 2, 56, 64, 83, 38, 65, 32, 87, 76, 89, 87, 35, 39, 77, 30, 21, 45, 99, 23, 27, 28, 81, 12, 56, 83, 37, 69, 66, 90, 5, 18, 6, 53, 78, 77, 48, 31, 36, 80, 16, 74, 84, 20, 25, 49, 81, 80, 13, 86, 74, 62, 72, 96, 35, 27, 83, 18, 89, 22, 50, 45, 51, 17, 33, 58, 58, 39, 79, 60, 2, 2, 59, 10, 67, 45, 100, 58, 53, 58, 14, 73, 22, 23,
             41, 81, 21, 44, 72, 98, 21, 81, 89, 59, 47, 82, 95, 58, 15, 16, 49, 76, 61, 10, 1, 16, 78, 80, 20, 39, 47, 60, 32, 93, 73, 45, 53, 47, 14, 15, 18, 27, 18, 76, 21, 49, 57, 86, 44, 49, 56, 92, 89, 20, 29, 65, 16, 44, 13, 31, 74, 23, 2, 5, 31, 18, 78, 25, 16, 78, 42, 83, 42, 70, 56, 59, 46, 22, 66, 58, 21, 50, 43, 39, 49, 89, 14, 51, 33, 32, 93, 63, 32, 62, 16, 1, 96, 81, 78, 82, 93, 48, 58, 40, 49, 12, 62, 70, 81, 44, 47, 52, 24, 69, 63, 90, 72, 1, 80, 44, 4, 80, 22, 61, 27, 95, 6, 11, 100, 29, 69, 22, 68, 88, 2, 8, 3, 27, 89, 5, 32, 97, 31, 7, 70, 67, 89, 95, 52, 65, 10, 72, 72, 2, 66]
    # array = []
    # while(len(array) < 100):
    #     try:
    #         ent_number = int(input())
    #         array += [ent_number]
    #     except ValueError:
    #         break
    return array


def arithmetic_mean(arrey):
    """
        Возвращает среднее арифметическое значение, полученного массива
    """

    count = 0
    for i in arrey:
        count += i
    return count / len(arrey)


def maximum_minimum(array, max_min):
    """ 
        Находит максимальное или минимальное значение в массиве,
        в зависимости от переданного второго аргумента
    """
    # Если ищем минимальное значение
    if max_min == "min":
        min = array[0]
        for i in array:
            if i < min:
                min = i
        return min
    # Если ищем максимальное значение
    elif max_min == "max":
        max = array[0]
        for i in array:
            if i > max:
                max = i
        return max


def sum_of_remainder_of_division(array):
    """
        Выводит cумму остатков от деления суммы троек на последнее
        число тройки (каждые 3 введеных числа образуют тройку).
    """
    remains = 0     # Итоговая сумма, возвращаемая из функции
    three = 0       # Счетчик перехода на следующую тройку
    for i in range(int(len(array) / 3)):
        three_sum = 0
        for k in range(3):
            three_sum += array[k + three]
        remains += three_sum % array[three + 2]
        three += 3

    return remains


main()
